app/views/movies/index.html.erb

<h1><%= pluralize(@movies.size, "Movie") %></h1>
---
SELECT  "movies".* FROM "movies"  LIMIT 1
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "movies"  LIMIT 1) subquery_for_count